src_ext/InformationRegisters/УЗ_Настройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>УЗ_Настройки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Кассы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьОкругление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребоватьОписаниеКНеоплаченнымУрокам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребоватьОписаниеКНеоплаченнымУрокамС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьОповещения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодОповещения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОповещатьОЗадолженности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_ext/InformationRegisters/УЗ_Настройки/Forms/ФормаЗаписи/Ext/Form/Module.bsl
//Регистр без измерений — одна запись. Стандартная форма записи открывала её как новую
//(«Настройки (создание)») и падала на записи «Запись с такими ключевыми полями существует».
//Поэтому форма без основного реквизита: читает и пишет единственную запись менеджером записи.

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Менеджер = РегистрыСведений.УЗ_Настройки.СоздатьМенеджерЗаписи();
	Менеджер.Прочитать();
	ЗначениеВРеквизитФормы(Менеджер, "Запись");
	ТолькоПросмотр = Не ПравоДоступа("Изменение", Метаданные.РегистрыСведений.УЗ_Настройки);

КонецПроцедуры

&НаСервере
Функция ЗаписатьНаСервере()

	Менеджер = РеквизитФормыВЗначение("Запись");
	Попытка
		Менеджер.Записать(Истина);
	Исключение
		УЗ_Общий.ЗаписатьОшибку("Настройки", ИнформацияОбОшибке(), НСтр("ru = 'Не удалось записать настройки'"));
		Возврат Ложь;
	КонецПопытки;
	Модифицированность = Ложь;
	Возврат Истина;

КонецФункции

&НаКлиенте
Процедура КомандаЗаписать(Команда)
	ЗаписатьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаписатьИЗакрыть(Команда)
	Если ЗаписатьНаСервере() Тогда
		Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОповещенияПриИзменении(Элемент)
	
	Если Запись.ИспользоватьОповещения Тогда
		
		Если Запись.ПериодОповещения = 0 Тогда
			Запись.ПериодОповещения = 300; // 5 минут
		КонецЕсли;
		
		Если Запись.ОповещатьОЗадолженности = 0 Тогда
			Запись.ОповещатьОЗадолженности = 2; // 2 дня
		КонецЕсли;
		
	КонецЕсли;
	
	ОбновитьВидимость();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимость()
	
	Если Запись.ИспользоватьОповещения Тогда		
		Элементы.ОповещатьОЗадолженности.Доступность 	= Истина;
		Элементы.ПериодОпопвещения.Доступность 			= Истина;
	Иначе
		Элементы.ОповещатьОЗадолженности.Доступность 	= Ложь;
		Элементы.ПериодОпопвещения.Доступность 			= Ложь;
	КонецЕсли;
	
КонецПроцедуры
